# Line Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FunctionId..::..Line Property
FunctionId Class See Also
---
The line number of the function throwing an exception.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Line { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Line As Integer
	Get
```

Visual C++
---
```text
public:
property int Line {
	int get ();
}
```

# See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace